<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;

class PermissionSeeder extends Seeder
{
    /**
     * Run the database seeds.
     *
     * @return void
     */
    public function run()
    {

        $permissions = [

            'المشرفين',
            'اضافة مشرف',
            'تعديل مشرف',
            'عرض مشرف',
            'حذف مشرف',

            'الوكلاء',
            'اضافة وكيل',
            'تعديل وكيل',
            'عرض وكيل',
            'حذف وكيل',

            'المستخدمين',
            'اضافة مستخدم',
            'تعديل مستخدم',
            'عرض مستخدم',
            'عرض طلبات مستخدم',
            'حذف مستخدم',

            'الصلاحيات',
            'اضافة صلاحية',
            'تعديل صلاحية',
            'عرض صلاحية',
            'حذف صلاحية',


            'العلامات التجارية',
            'إضافة علامة تجارية',
            'تعديل علامة تجارية',
            'حذف علامة تجارية',


            'التصنيفات',
            'اضافة تصنيف',
            'تعديل تصنيف',
            'حذف تصنيف',

            'المنتجات',
            'اضافة منتج',
            'تعديل منتج',
            'حذف منتج',

            'الطلبات',
            'عرض طلب',
            'تعديل طلب',
            'طباعة طلب',

            'اكواد الخصم',
            'إضافة كود خصم',
            'تعديل كود خصم',
            'حذف كود خصم',


            'الدول',
            'اضافة دولة',
            'تعديل دولة',
            'حذف دولة',

            'المدن',
            'اضافة مدينة',
            'تعديل مدينة',
            'حذف مدينة',

            'السلايدر',
            'اضافة سلايدر',
            'تعديل سلايدر',
            'حذف سلايدر',

            'اتصل بنا',
            'عرض اتصل بنا',
            'حذف اتصل بنا',


            'من نحن',
            'تعديل من نحن',

            'الاعدادات',
            'تعديل الاعدادات',






        ];


        foreach ($permissions as $permission) {

            Permission::create(['name' => $permission,
                'guard_name'=>'admin'
            ]);
        }
    }
}
